In [32]:
import pandas as pd

### **Read CSV**

In [33]:
df=pd.read_csv("data.csv")
df.head(3)

,ID,Name,Age,Department,Join_Date,Hours_Worked,Salary,Performance_Score
0,1,Chris Johnson,NaN,Engineering,Invalid Date,NaN,NaN,5
1,2,Jane Smith,NaN,Marketing,20-05-2021,58.623174,NaN,Unknown
2,3,John Doe,44.0,NaN,30-07-2022,NaN,NaN,NaN

### **DataFrame**

In [34]:
# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'City':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
        'IsActive':[True,True,False,True]}
 
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
df.head(3)

     Name  Age       City Qualification  IsActive
0     Jai   27      Delhi           Msc      True
1  Princi   24     Kanpur            MA      True
2  Gaurav   22  Allahabad           MCA     False

### **Shape  of df**
- no of rows and cols

In [35]:
df.shape

(4, 5)

In [36]:
row ,cols =df.shape
print("row:",row)
print("cols:",cols)

row: 4
cols: 5